docs/posts/2025-08-27-how-autocrats-destroy-truth.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Aug 27, 2025 07:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How Autocrats Destroy Truth</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">How Autocrats Destroy Truth
<br />
<span class="subtitle">Aug 27, 2025 05:30</span>
</h1>
<p>
I&rsquo;ve often wondered why the administration continues to make claims that are laughably and provably false, such as Trump&rsquo;s claim that one of his prominent critics, Gov. Wes Moore of Maryland called him &ldquo;the greatest president of my lifetime.&rdquo;
</p>

<p>
Anne Applebaum writing for <a href="https://www.theatlantic.com/magazine/archive/2024/06/china-russia-republican-party-relations/678271/"><i>The Atlantic</i></a>:
</p>

<blockquote>
<p>
This tactic—the so-called fire hose of falsehoods—ultimately produces not outrage but nihilism. Given so many explanations, how can you know what actually happened? What if you just can’t know? If you don’t know what happened, you’re not likely to join a great movement for democracy, or to listen when anyone speaks about positive political change. Instead, you are not going to participate in any politics at all.
</p>
</blockquote>

<p>
The country is gathering into large groups &mdash; the gullible true believers who believe everything and the cynical skeptics who believe nothing. Those in the former group obviously serve the interests of the powers that be by their unreflective support. Those in the latter also serve the interests of the ruling powers with their despairing malaise.  It&rsquo;s in the interests of the autocrats to ensure that, if you can&rsquo;t be one of the gullibile, you at least become a nihilist.
</p>

<p>
Seek the truth, hold on to hope, keep the faith.
</p>

<div class="tagline" id="org0a98bf4">
<p>
Tagged:  <a href="../tags/politics.html">Politics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Aug 27, 2025 07:24.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
